{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "\u0000": 0,
      "\u0001": 1,
      "\u0002": 2,
      "\u0003": 3,
      "\u0004": 4,
      "\u0005": 5,
      "\u0006": 6,
      "\u0007": 7,
      "\b": 8,
      "\t": 9,
      "\n": 10,
      "\u000b": 11,
      "\f": 12,
      "\r": 13,
      "\u000e": 14,
      "\u000f": 15,
      "\u0010": 16,
      "\u0011": 17,
      "\u0012": 18,
      "\u0013": 19,
      "\u0014": 20,
      "\u0015": 21,
      "\u0016": 22,
      "\u0017": 23,
      "\u0018": 24,
      "\u0019": 25,
      "\u001a": 26,
      "\u001b": 27,
      "\u001c": 28,
      "\u001d": 29,
      "\u001e": 30,
      "\u001f": 31,
      " ": 32,
      "!": 33,
      "\"": 34,
      "#": 35,
      "$": 36,
      "%": 37,
      "&": 38,
      "'": 39,
      "(": 40,
      ")": 41,
      "*": 42,
      "+": 43,
      ",": 44,
      "-": 45,
      ".": 46,
      "/": 47,
      "0": 48,
      "1": 49,
      "2": 50,
      "3": 51,
      "4": 52,
      "5": 53,
      "6": 54,
      "7": 55,
      "8": 56,
      "9": 57,
      ":": 58,
      ";": 59,
      "<": 60,
      "=": 61,
      ">": 62,
      "?": 63,
      "@": 64,
      "A": 65,
      "B": 66,
      "C": 67,
      "D": 68,
      "E": 69,
      "F": 70,
      "G": 71,
      "H": 72,
      "I": 73,
      "J": 74,
      "K": 75,
      "L": 76,
      "M": 77,
      "N": 78,
      "O": 79,
      "P": 80,
      "Q": 81,
      "R": 82,
      "S": 83,
      "T": 84,
      "U": 85,
      "V": 86,
      "W": 87,
      "X": 88,
      "Y": 89,
      "Z": 90,
      "[": 91,
      "\\": 92,
      "]": 93,
      "^": 94,
      "_": 95,
      "`": 96,
      "a": 97,
      "b": 98,
      "c": 99,
      "d": 100,
      "e": 101,
      "f": 102,
      "g": 103,
      "h": 104,
      "i": 105,
      "j": 106,
      "k": 107,
      "l": 108,
      "m": 109,
      "n": 110,
      "o": 111,
      "p": 112,
      "q": 113,
      "r": 114,
      "s": 115,
      "t": 116,
      "u": 117,
      "v": 118,
      "w": 119,
      "x": 120,
      "y": 121,
      "z": 122,
      "{": 123,
      "|": 124,
      "}": 125,
      "~": 126,
      "": 127,
      "": 128,
      "": 129,
      "": 130,
      "": 131,
      "": 132,
      "": 133,
      "": 134,
      "": 135,
      "": 136,
      "": 137,
      "": 138,
      "": 139,
      "": 140,
      "": 141,
      "": 142,
      "": 143,
      "": 144,
      "": 145,
      "": 146,
      "": 147,
      "": 148,
      "": 149,
      "": 150,
      "": 151,
      "": 152,
      "": 153,
      "": 154,
      "": 155,
      "": 156,
      "": 157,
      "": 158,
      "": 159,
      " ": 160,
      "¡": 161,
      "¢": 162,
      "£": 163,
      "¤": 164,
      "¥": 165,
      "¦": 166,
      "§": 167,
      "¨": 168,
      "©": 169,
      "ª": 170,
      "«": 171,
      "¬": 172,
      "­": 173,
      "®": 174,
      "¯": 175,
      "°": 176,
      "±": 177,
      "²": 178,
      "³": 179,
      "´": 180,
      "µ": 181,
      "¶": 182,
      "·": 183,
      "¸": 184,
      "¹": 185,
      "º": 186,
      "»": 187,
      "¼": 188,
      "½": 189,
      "¾": 190,
      "¿": 191,
      "À": 192,
      "Á": 193,
      "Â": 194,
      "Ã": 195,
      "Ä": 196,
      "Å": 197,
      "Æ": 198,
      "Ç": 199,
      "È": 200,
      "Ā": 201,
      "ā": 202,
      "Ă": 203,
      "ă": 204,
      "Ą": 205,
      "ą": 206,
      "Ć": 207,
      "ć": 208,
      "Ĉ": 209,
      "ĉ": 210,
      "Ċ": 211,
      "ċ": 212,
      "Č": 213,
      "č": 214,
      "Ď": 215,
      "ď": 216,
      "Đ": 217,
      "đ": 218,
      "Ē": 219,
      "ē": 220,
      "Ĕ": 221,
      "ĕ": 222,
      "Ė": 223,
      "ė": 224,
      "Ę": 225,
      "ę": 226,
      "Ě": 227,
      "ě": 228,
      "Ĝ": 229,
      "ĝ": 230,
      "Ğ": 231,
      "ğ": 232,
      "Ġ": 233,
      "ġ": 234,
      "Ģ": 235,
      "ģ": 236,
      "Ĥ": 237,
      "ĥ": 238,
      "Ħ": 239,
      "ħ": 240,
      "Ĩ": 241,
      "ĩ": 242,
      "Ī": 243,
      "ī": 244,
      "Ĭ": 245,
      "ĭ": 246,
      "Į": 247,
      "į": 248,
      "İ": 249,
      "ı": 250,
      "Ĳ": 251,
      "ĳ": 252,
      "Ĵ": 253,
      "ĵ": 254,
      "Ķ": 255,
      "ķ": 256,
      "ĸ": 257,
      "Ĺ": 258,
      "ĺ": 259,
      "Ļ": 260,
      "ļ": 261,
      "Ľ": 262,
      "ľ": 263,
      "Ŀ": 264,
      "ŀ": 265,
      "Ł": 266,
      "ł": 267,
      "Ń": 268,
      "dd": 269,
      "dddd": 270,
      "dddddd": 271,
      "dddddddd": 272,
      "dc": 273,
      "de": 274,
      "ddddddc": 275,
      "dddddde": 276,
      "dddddddddddd": 277,
      "db": 278,
      "df": 279,
      "ddc": 280,
      "dddddddddddddddd": 281,
      "dde": 282,
      "ddddddf": 283,
      "ddddddb": 284,
      "ddde": 285,
      "dddc": 286,
      "ddddddcddddddc": 287,
      "ee": 288,
      "cc": 289,
      "ddddddedddddde": 290,
      "ddddc": 291,
      "dddde": 292,
      "da": 293,
      "dg": 294,
      "dddddddddddddc": 295,
      "ddddddddddddde": 296,
      "ec": 297,
      "dddddddddddddddddddddddddddddddd": 298,
      "ce": 299,
      "ede": 300,
      "cdc": 301,
      "dh": 302,
      "dddddddddddddb": 303,
      "dddddddddddddf": 304,
      "dddddddddddddddddddd": 305,
      "ddb": 306,
      "ddf": 307,
      "ddddddeddddddc": 308,
      "ef": 309,
      "bc": 310,
      "ddddddg": 311,
      "edc": 312,
      "ddddddedddddddddddddc": 313,
      "dddddda": 314,
      "dedc": 315,
      "dec": 316,
      "ddddddeddddddf": 317,
      "ddddddcddddddddddddde": 318,
      "eb": 319,
      "edddd": 320,
      "di": 321,
      "fc": 322,
      "dddddddc": 323,
      "dcc": 324,
      "ddddddcddddddcddddddedddddde": 325,
      "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd": 326,
      "ddddddbddddddb": 327,
      "ddddddde": 328,
      "dcde": 329,
      "cdddd": 330,
      "ddddedc": 331,
      "dda": 332,
      "cb": 333,
      "ddddcde": 334,
      "fe": 335,
      "ddg": 336,
      "ddddddbddddddc": 337,
      "ddddddfddddddf": 338,
      "ddddcdc": 339,
      "dddf": 340,
      "dee": 341,
      "dddb": 342,
      "ddcddde": 343,
      "be": 344,
      "ddedddc": 345,
      "ddddede": 346,
      "dj": 347,
      "cf": 348,
      "cde": 349,
      "ddddddcddddddcddddddcddddddc": 350,
      "ff": 351,
      "ddddddbdddddddddddddf": 352,
      "bb": 353,
      "eg": 354,
      "ac": 355,
      "ddcdc": 356,
      "ddddddeddddddeddddddedddddde": 357,
      "edf": 358,
      "ddddddcddddddcddddddf": 359,
      "ddede": 360,
      "eddc": 361,
      "ea": 362,
      "dddddddddddddcddddddddddddde": 363,
      "gc": 364,
      "dddddddddddddddddddde": 365,
      "ddddddcddddddedddddde": 366,
      "fb": 367,
      "ddddcdf": 368,
      "ed": 369,
      "ddddddddddddddddddddc": 370,
      "cdde": 371,
      "ddddddddde": 372,
      "ddddddfdddddde": 373,
      "edde": 374,
      "dddddddddc": 375,
      "ddddedb": 376,
      "ddddddcddddddb": 377,
      "dk": 378,
      "eddde": 379,
      "cdb": 380,
      "dddddddddddddbdddddddddddddf": 381,
      "dddddc": 382,
      "ddd": 383,
      "ddh": 384,
      "bf": 385,
      "ca": 386,
      "ddddde": 387,
      "cddc": 388,
      "edb": 389,
      "cg": 390,
      "dcdc": 391,
      "cd": 392,
      "eh": 393,
      "bd": 394,
      "ddddedf": 395,
      "ddddcdb": 396,
      "edddc": 397,
      "dede": 398,
      "dddg": 399,
      "cdddc": 400,
      "ddddddbddddddf": 401,
      "ecc": 402,
      "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd": 403,
      "ddda": 404,
      "fa": 405,
      "bg": 406,
      "ddddedddddddd": 407,
      "ddddddcddddddcddddddeddddddeddddddcddddddcddddddedddddde": 408,
      "ba": 409,
      "ddddcdddddddd": 410,
      "fg": 411,
      "dddddddddddc": 412,
      "ddddddh": 413,
      "bdc": 414,
      "fd": 415,
      "ddcdddc": 416,
      "cdf": 417,
      "fde": 418,
      "edg": 419,
      "cdcddde": 420,
      "ddeddde": 421,
      "ededddc": 422,
      "cddde": 423,
      "ddddddcddddddcddddddddddddde": 424,
      "ch": 425,
      "Âģ": 426,
      "ddddddeddddddcddddddeddddddc": 427,
      "dddddddddddddcddddddcddddddedddddde": 428,
      "dedddd": 429,
      "ddddddcddddddcddddddedddddddddddddc": 430,
      "dl": 431,
      "dddddddddddddbddddddc": 432,
      "dcdddd": 433,
      "aa": 434,
      "ei": 435,
      "ddedc": 436,
      "deddc": 437,
      "eedc": 438,
      "fdc": 439,
      "cec": 440,
      "eda": 441,
      "bdb": 442,
      "cee": 443,
      "fdf": 444,
      "ad": 445,
      "edddddc": 446,
      "ÂĢ": 447,
      "bh": 448,
      "ddddddcdddddde": 449,
      "ddddddddddde": 450,
      "cda": 451,
      "gg": 452,
      "fh": 453,
      "ÂĤ": 454,
      "ddddddddddddda": 455,
      "ag": 456,
      "ddddddd": 457,
      "bcc": 458,
      "ddddddcddddddf": 459,
      "dddddddddedddc": 460,
      "ddcde": 461,
      "ddec": 462,
      "ddddcdg": 463,
      "ddddddbddddddddddddde": 464,
      "ae": 465,
      "dddddddddcddde": 466,
      "fee": 467,
      "dddddddddddddg": 468,
      "ddddddcddddddcddddddc": 469,
      "bde": 470,
      "ddi": 471,
      "eddddde": 472,
      "ddddeda": 473,
      "ddededc": 474,
      "dddddddddddddddddddddddddddd": 475,
      "``": 476,
      "ej": 477,
      "ddddddfdddddddddddddb": 478,
      "ddddddbddddddedddddde": 479,
      "dm": 480,
      "ddddddcdddddddddddddf": 481,
      "ab": 482,
      "ci": 483,
      "dddddddddde": 484,
      "cdg": 485,
      "dedddc": 486,
      "ddce": 487,
      "dddh": 488,
      "ddddddeddddddcddddddcddddddedddddde": 489,
      "ddddedcddddedc": 490,
      "deec": 491,
      "Âĥ": 492,
      "ddddddddddc": 493,
      "af": 494,
      "ah": 495,
      "ddddddddddddddddddddddddddde": 496,
      "dddeddc": 497,
      "ccde": 498,
      "ddcdddeddcddde": 499,
      "dddddddddddddddddddddddddddc": 500,
      "dddddddddddddbddddddddddddde": 501,
      "dddcddc": 502,
      "dddddddddddddcddddddedddddde": 503,
      "fdb": 504,
      "gd": 505,
      "dddcddb": 506,
      "ddddddcdddddddddddddeddddddcddddddddddddde": 507,
      "ddddddeddddddedddddde": 508,
      "gb": 509,
      "ddddddbdddddde": 510,
      "ddddcda": 511,
      "dddddddddddddddddddddddddddddddddddddddddddddddd": 512,
      "ddcdcde": 513,
      "dddedde": 514,
      "gf": 515,
      "dcdde": 516,
      "ddddcdeddddcde": 517,
      "dedde": 518,
      "dddeddf": 519,
      "dddcdde": 520,
      "ddddedg": 521,
      "ddddddcddddddcddddddcddddddcddddddcddddddcddddddcddddddc": 522,
      "ÂĦ": 523,
      "_`": 524,
      "bi": 525,
      "dcddc": 526,
      "ddddddeddddddcddddddddddddde": 527,
      "ge": 528,
      "dn": 529,
      "Âħ": 530,
      "dcddde": 531,
      "dedb": 532,
      "eeec": 533,
      "ddedddcddedddc": 534,
      "fdg": 535,
      "fi": 536,
      "gh": 537,
      "bdf": 538,
      "ga": 539,
      "ddddddeddddddcddddddc": 540,
      "decc": 541,
      "ddcdddf": 542,
      "dZ": 543,
      "cj": 544,
      "edh": 545,
      "dcee": 546,
      "bee": 547,
      "ddedddb": 548,
      "ek": 549,
      "ÂĨ": 550,
      "dddddddddddddbddddddedddddde": 551,
      "dddddddddddddcdddddddddddddedddddddddddddcddddddddddddde": 552,
      "bda": 553,
      "bec": 554,
      "dcdf": 555,
      "dY": 556,
      "ddddddbddddddcddddddeddddddf": 557,
      "fcc": 558,
      "fec": 559,
      "dddddddddddddbdddddddddddddfdddddddddddddbdddddddddddddf": 560,
      "dddeddb": 561,
      "ddddddcddddddcdddddde": 562,
      "ddddddcddddddcddddddeddddddeddddddcddddddddddddde": 563,
      "dddddcc": 564,
      "ddddddcddddddedddddddddddddc": 565,
      "dddcddf": 566,
      "ddddddcddddddbdddddddddddddf": 567,
      "cddddde": 568,
      "Âĩ": 569,
      "cedc": 570,
      "ddddddgddddddg": 571,
      "ddcec": 572,
      "`_": 573,
      "ÂĪ": 574,
      "edddddb": 575,
      "do": 576,
      "ddddddfddddddeddddddc": 577,
      "ddddcdcddddcdc": 578,
      "ddddddcddddddeddddddf": 579,
      "ddddddbddddddedddddddddddddc": 580,
      "ccc": 581,
      "ddddddadddddda": 582,
      "fef": 583,
      "ddddddcddddddcddddddedddddddddddddcddddddddddddde": 584,
      "ai": 585,
      "hc": 586,
      "^`": 587,
      "ddddddeddddddedddddddddddddc": 588,
      "ddddededdddede": 589,
      "ddddddbddddddeddddddf": 590,
      "ddedf": 591,
      "fce": 592,
      "cdddddc": 593,
      "edd": 594,
      "edddddf": 595,
      "cdcdc": 596,
      "hh": 597,
      "gi": 598,
      "fj": 599,
      "bj": 600,
      "ddcc": 601,
      "el": 602,
      "eddf": 603,
      "dddddec": 604,
      "ddddddeddddddeddddddeddddddeddddddeddddddeddddddedddddde": 605,
      "cdddddf": 606,
      "__": 607,
      "ddcdb": 608,
      "ÂĬ": 609,
      "fda": 610,
      "ddddddfdddddddddddddc": 611,
      "ddddddeddddddb": 612,
      "ddddddddc": 613,
      "ddece": 614,
      "ddddddcddddddcddddddfddddddcddddddcddddddf": 615,
      "bdg": 616,
      "dddded": 617,
      "ddddddbddddddbddddddbddddddb": 618,
      "dddddddddddddbddddddcddddddeddddddf": 619,
      "dddddb": 620,
      "ded": 621,
      "hg": 622,
      "hd": 623,
      "ddj": 624,
      "cdddddb": 625,
      "adb": 626,
      "ck": 627,
      "ddddddfddddddc": 628,
      "gee": 629,
      "dcce": 630,
      "Âī": 631,
      "dddddf": 632,
      "dedf": 633,
      "Âĭ": 634,
      "ddcdddg": 635,
      "bdde": 636,
      "eddb": 637,
      "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd": 638,
      "dddddddddddddcddddddcddddddeddddddedddddddddddddcddddddcddddddedddddde": 639,
      "ddccc": 640,
      "fdh": 641,
      "`^": 642,
      "adc": 643,
      "hb": 644,
      "acc": 645,
      "dddddddde": 646,
      "ecde": 647,
      "ebc": 648,
      "cdh": 649,
      "bce": 650,
      "dddcdda": 651,
      "aj": 652,
      "ddddddeddddddcdddddde": 653,
      "gdf": 654,
      "Âį": 655,
      "ddcdcdc": 656,
      "ddddddeddddddddddddddddddddc": 657,
      "em": 658,
      "ddcdddb": 659,
      "^_": 660,
      "dddeedc": 661,
      "eedddd": 662,
      "ddddddgddddddc": 663,
      "ddddddeddddddcddddddcddddddddddddde": 664,
      "ddddedddddde": 665,
      "ccdc": 666,
      "dfdc": 667,
      "dddddddedc": 668,
      "fddc": 669,
      "dX": 670,
      "]`": 671,
      "eede": 672,
      "eedb": 673,
      "ddddcddddddc": 674,
      "ddededcddededc": 675,
      "cl": 676,
      "dddddddddddddbddddddeddddddf": 677,
      "dddddddddddddcddddddcddddddddddddde": 678,
      "ddddddfddddddfddddddfddddddf": 679,
      "ÂĲ": 680,
      "cdd": 681,
      "ha": 682,
      "fk": 683,
      "fdde": 684,
      "ddddddbdddddddddddddfddddddcddddddcddddddf": 685,
      "cdcdddecdcddde": 686,
      "ddddddadddddde": 687,
      "ddedede": 688,
      "dddddddddddddcdddddddddddddeddddddeddddddcddddddcddddddedddddde": 689,
      "ÂĮ": 690,
      "ddeddda": 691,
      "ddddcd": 692,
      "ecdc": 693,
      "ccce": 694,
      "ddddddddddddddddddddeddddddc": 695,
      "cdcdcde": 696,
      "ig": 697,
      "dddeddg": 698,
      "ddddddedddddddddddddcddddddedddddddddddddc": 699,
      "ddedddf": 700,
      "dp": 701,
      "ddddddddddddddddddddf": 702,
      "dW": 703,
      "dddddddddddddbddddddf": 704,
      "eZ": 705,
      "gde": 706,
      "bk": 707,
      "ic": 708,
      "ddddddbddddddcddddddf": 709,
      "eee": 710,
      "ddcdde": 711,
      "dddddddededddc": 712,
      "ddddddbddddddcddddddddddddde": 713,
      "ccdf": 714,
      "ededddcededddc": 715,
      "Âĳ": 716,
      "dq": 717,
      "ddddddcdddddddddddddddddddde": 718,
      "gdc": 719,
      "ddddcdddddde": 720,
      "ddddcc": 721,
      "ddddddcddddddcddddddedddddddddddddcddddddedddddde": 722,
      "he": 723,
      "_^": 724,
      "gj": 725,
      "eec": 726,
      "ddddf": 727,
      "hf": 728,
      "ddddddi": 729,
      "ecdf": 730,
      "dddddddcdcddde": 731,
      "ddddeddddddc": 732,
      "ia": 733,
      "ddddb": 734,
      "ddddddfddddddedddddddddddddc": 735,
      "Âİ": 736,
      "ddddddbddddddcddddddfdddddde": 737,
      "edededc": 738,
      "dddddddddddddd": 739,
      "ddddddcddddddcddddddeddddddeddddddcddddddcddddddeddddddeddddddcddddddcddddddedddddde": 740,
      "beb": 741,
      "gcc": 742,
      "\\`": 743,
      "dddddddddddddcddddddc": 744,
      "deda": 745,
      "eecc": 746,
      "bef": 747,
      "cbc": 748,
      "en": 749,
      "ddeddc": 750,
      "ddddddcddddddcddddddeddddddf": 751,
      "cZ": 752,
      "ada": 753,
      "hi": 754,
      "ddecc": 755,
      "dddedc": 756,
      "ddddcdddddddde": 757,
      "cddf": 758,
      "eY": 759,
      "edddddddddddd": 760,
      "dddi": 761,
      "dddcddg": 762,
      "cY": 763,
      "cdec": 764,
      "dr": 765,
      "fl": 766,
      "ddddee": 767,
      "edi": 768,
      "ddddddgdddddde": 769,
      "ak": 770,
      "cddb": 771,
      "gdg": 772,
      "eo": 773,
      "dddddddddddddddddddddddd": 774,
      "bY": 775,
      "`]": 776,
      "ededc": 777,
      "ddddddbddddddfddddddbddddddf": 778,
      "bddc": 779,
      "cecc": 780,
      "ddddddbddddddcddddddedddddde": 781,
      "ade": 782,
      "bl": 783,
      "ddedb": 784,
      "Âı": 785,
      "ecee": 786,
      "ddddeddddddddc": 787,
      "ddcdcdf": 788,
      "ddededb": 789,
      "aee": 790,
      "bdh": 791,
      "ds": 792,
      "dV": 793,
      "ddddddedddddddddddddcddddddcddddddddddddde": 794,
      "eddddda": 795,
      "ddeddd": 796,
      "ddddddfddddddb": 797,
      "hj": 798,
      "ddddddaddddddc": 799,
      "ddddddcddddddbddddddeddddddf": 800,
      "ddddddddddddddddedddc": 801,
      "dddddddddddddbdddddddddddddfdddddddddddddbddddddddddddde": 802,
      "dddedda": 803,
      "cdddddg": 804,
      "cdddddddddddd": 805,
      "cfc": 806,
      "ddddddddddddddddddddddddddddddddddddddddde": 807,
      "dddddddddddedb": 808,
      "ddcdcdeddcdcde": 809,
      "dddddddddddddbddddddcddddddedddddde": 810,
      "ddddcddddddddb": 811,
      "ddddcdh": 812,
      "ddddddcddddddbddddddedddddde": 813,
      "adf": 814,
      "ddedddd": 815,
      "ddddeddddddddf": 816,
      "ddk": 817,
      "bbc": 818,
      "ddcdddd": 819,
      "cdcdb": 820,
      "edddddg": 821,
      "dddddddddddcdf": 822,
      "gdb": 823,
      "cedb": 824,
      "dddcdddddddd": 825,
      "dddddddddcdddedddddddddedddc": 826,
      "\\_": 827,
      "dddccde": 828,
      "ddddddddddddddddddddb": 829,
      "bZ": 830,
      "edddf": 831,
      "deee": 832,
      "ddcee": 833,
      "gef": 834,
      "dddedddddddd": 835,
      "ddddddbddddddedddddddddddddcddddddf": 836,
      "ddddddddddddddddcddde": 837,
      "dcec": 838,
      "if": 839,
      "cede": 840,
      "^^": 841,
      "ddeee": 842,
      "aec": 843,
      "ced": 844,
      "`\\": 845,
      "edddddde": 846,
      "dddcedc": 847,
      "cn": 848,
      "dddddddddddddddddddddddddddddddddddddddddddddddddddddddd": 849,
      "dedddde": 850,
      "ededf": 851,
      "ccee": 852,
      "dddddddddddddddddddddddddddddddddddddddddc": 853,
      "]_": 854,
      "ddddddeddddddcddddddeddddddcddddddeddddddcddddddeddddddc": 855,
      "dddcdc": 856,
      "dU": 857,
      "ddddddeddddddg": 858,
      "dddddddddddcdc": 859,
      "ddcdf": 860,
      "ddcdddedddddddddedddc": 861,
      "cX": 862,
      "fedc": 863,
      "deedc": 864,
      "ddddcddddddddc": 865,
      "al": 866,
      "ib": 867,
      "fm": 868,
      "gk": 869,
      "id": 870,
      "feb": 871,
      "ddddedddddddde": 872,
      "ih": 873,
      "dddddddddddddde": 874,
      "ccd": 875,
      "gl": 876,
      "ddddddbdddddda": 877,
      "dddeede": 878,
      "dddecde": 879,
      "ecd": 880,
      "bfc": 881,
      "ddddddeddddddeddddddddddddddddddddc": 882,
      "cm": 883,
      "dddcde": 884,
      "]^": 885,
      "ep": 886,
      "ecdb": 887,
      "ddddeddddddddb": 888,
      "fbc": 889,
      "dddccdc": 890,
      "ddddddgddddddf": 891,
      "dcdb": 892,
      "dcddddc": 893,
      "deddddc": 894,
      "cdddb": 895,
      "ddddddeddddddcddddddedddddddddddddc": 896,
      "dedg": 897,
      "aY": 898,
      "[`": 899,
      "fY": 900,
      "fZ": 901,
      "dddddddddddedc": 902,
      "ddddddcddddddcdddddddddddddddddddde": 903,
      "ccdddd": 904,
      "edddedc": 905,
      "dcd": 906,
      "eddg": 907,
      "ddddddedddc": 908,
      "ddedcdc": 909,
      "ddddedcddddedcddddedcddddedc": 910,
      "fdi": 911,
      "_\\": 912,
      "ddddddcddde": 913,
      "ddddddcddddddbddddddb": 914,
      "cddddda": 915,
      "ddcdcdg": 916,
      "dddddddddddddedddddde": 917,
      "eq": 918,
      "ddcdede": 919,
      "bn": 920,
      "hk": 921,
      "dddcdd": 922,
      "ffc": 923,
      "decdc": 924,
      "acb": 925,
      "dece": 926,
      "ddddedh": 927,
      "bm": 928,
      "dbdc": 929,
      "dbee": 930,
      "ddddddcdc": 931,
      "deeb": 932,
      "cccc": 933,
      "ddddcddddddddf": 934,
      "dddddddddddede": 935,
      "edddddddd": 936,
      "fn": 937,
      "fcdc": 938,
      "ij": 939,
      "gce": 940,
      "ddddddeddddddbddddddb": 941,
      "eed": 942,
      "ddddddaddddddf": 943,
      "dddddddddddcdb": 944,
      "adg": 945,
      "cdedc": 946,
      "ddededa": 947,
      "co": 948,
      "eX": 949,
      "dfd": 950,
      "ddcddc": 951,
      "ddddddbdddddddddddddfddddddcddddddcddddddfdddddddddddddbddddddedddddde": 952,
      "^]": 953,
      "bdd": 954,
      "gec": 955,
      "ddddddeddddddcddddddbdddddddddddddf": 956,
      "_]": 957,
      "fo": 958,
      "gY": 959,
      "edddb": 960,
      "ÂĴ": 961,
      "deede": 962,
      "\\^": 963,
      "dbd": 964,
      "ddddddeddddddcddddddddddddddddddddc": 965,
      "fdec": 966,
      "ddedddg": 967,
      "Td": 968,
      "eW": 969,
      "[_": 970,
      "ja": 971,
      "ii": 972,
      "dccc": 973,
      "ddddddedddddddddddddcddddddddddddde": 974,
      "cdddddcc": 975,
      "jh": 976,
      "eeee": 977,
      "bede": 978,
      "bo": 979,
      "\\]": 980,
      "cfe": 981,
      "fdd": 982,
      "gdh": 983,
      "ccdde": 984,
      "aZ": 985,
      "am": 986,
      "jd": 987,
      "decdb": 988,
      "aeb": 989,
      "deddddb": 990,
      "cW": 991,
      "ddddddeddddddcddddddbddddddcddddddeddddddf": 992,
      "`[": 993,
      "ddddddedddddddddddddb": 994,
      "eddddd": 995,
      "bed": 996,
      "ddddcdeddddcdeddddcdeddddcde": 997,
      "ie": 998,
      "dcede": 999,
      "edddddee": 1000,
      "edda": 1001,
      "eedf": 1002,
      "ddddddaddddddg": 1003,
      "Âĵ": 1004,
      "bdi": 1005,
      "eU": 1006,
      "gZ": 1007,
      "ddddddeddddddcddddddcddddddeddddddeddddddcddddddcddddddedddddde": 1008,
      "ddddddaddddddb": 1009,
      "decde": 1010,
      "hee": 1011,
      "ecdg": 1012,
      "decddde": 1013,
      "ddddddddddddddc": 1014,
      "deeddc": 1015,
      "ddddda": 1016,
      "ddddddfddddddedddddde": 1017,
      "ddddcdfddddcdf": 1018,
      "dddddddddddddddddddddddddd": 1019,
      "ddedddcdddddddddcddde": 1020,
      "dddddddddddedf": 1021,
      "jj": 1022,
      "dcdddde": 1023
    },
    "merges": [
      [
        "d",
        "d"
      ],
      [
        "dd",
        "dd"
      ],
      [
        "dddd",
        "dd"
      ],
      [
        "dddd",
        "dddd"
      ],
      [
        "d",
        "c"
      ],
      [
        "d",
        "e"
      ],
      [
        "dddddd",
        "c"
      ],
      [
        "dddddd",
        "e"
      ],
      [
        "dddddddd",
        "dddd"
      ],
      [
        "d",
        "b"
      ],
      [
        "d",
        "f"
      ],
      [
        "dd",
        "c"
      ],
      [
        "dddddddd",
        "dddddddd"
      ],
      [
        "dd",
        "e"
      ],
      [
        "dddddd",
        "f"
      ],
      [
        "dddddd",
        "b"
      ],
      [
        "dd",
        "de"
      ],
      [
        "dd",
        "dc"
      ],
      [
        "ddddddc",
        "ddddddc"
      ],
      [
        "e",
        "e"
      ],
      [
        "c",
        "c"
      ],
      [
        "dddddde",
        "dddddde"
      ],
      [
        "dddd",
        "c"
      ],
      [
        "dddd",
        "e"
      ],
      [
        "d",
        "a"
      ],
      [
        "d",
        "g"
      ],
      [
        "dddddddddddd",
        "dc"
      ],
      [
        "dddddddddddd",
        "de"
      ],
      [
        "e",
        "c"
      ],
      [
        "dddddddddddddddd",
        "dddddddddddddddd"
      ],
      [
        "c",
        "e"
      ],
      [
        "e",
        "de"
      ],
      [
        "c",
        "dc"
      ],
      [
        "d",
        "h"
      ],
      [
        "dddddddddddd",
        "db"
      ],
      [
        "dddddddddddd",
        "df"
      ],
      [
        "dddddddd",
        "dddddddddddd"
      ],
      [
        "dd",
        "b"
      ],
      [
        "dd",
        "f"
      ],
      [
        "dddddde",
        "ddddddc"
      ],
      [
        "e",
        "f"
      ],
      [
        "b",
        "c"
      ],
      [
        "dddddd",
        "g"
      ],
      [
        "e",
        "dc"
      ],
      [
        "dddddde",
        "dddddddddddddc"
      ],
      [
        "dddddd",
        "a"
      ],
      [
        "de",
        "dc"
      ],
      [
        "de",
        "c"
      ],
      [
        "dddddde",
        "ddddddf"
      ],
      [
        "ddddddc",
        "ddddddddddddde"
      ],
      [
        "e",
        "b"
      ],
      [
        "e",
        "dddd"
      ],
      [
        "d",
        "i"
      ],
      [
        "f",
        "c"
      ],
      [
        "dddddd",
        "dc"
      ],
      [
        "dc",
        "c"
      ],
      [
        "ddddddcddddddc",
        "ddddddedddddde"
      ],
      [
        "dddddddddddddddddddddddddddddddd",
        "dddddddddddddddddddddddddddddddd"
      ],
      [
        "ddddddb",
        "ddddddb"
      ],
      [
        "dddddd",
        "de"
      ],
      [
        "dc",
        "de"
      ],
      [
        "c",
        "dddd"
      ],
      [
        "dddde",
        "dc"
      ],
      [
        "dd",
        "a"
      ],
      [
        "c",
        "b"
      ],
      [
        "ddddc",
        "de"
      ],
      [
        "f",
        "e"
      ],
      [
        "dd",
        "g"
      ],
      [
        "ddddddb",
        "ddddddc"
      ],
      [
        "ddddddf",
        "ddddddf"
      ],
      [
        "ddddc",
        "dc"
      ],
      [
        "dd",
        "df"
      ],
      [
        "de",
        "e"
      ],
      [
        "dd",
        "db"
      ],
      [
        "ddc",
        "ddde"
      ],
      [
        "b",
        "e"
      ],
      [
        "dde",
        "dddc"
      ],
      [
        "dddde",
        "de"
      ],
      [
        "d",
        "j"
      ],
      [
        "c",
        "f"
      ],
      [
        "c",
        "de"
      ],
      [
        "ddddddcddddddc",
        "ddddddcddddddc"
      ],
      [
        "f",
        "f"
      ],
      [
        "ddddddb",
        "dddddddddddddf"
      ],
      [
        "b",
        "b"
      ],
      [
        "e",
        "g"
      ],
      [
        "a",
        "c"
      ],
      [
        "ddc",
        "dc"
      ],
      [
        "ddddddedddddde",
        "ddddddedddddde"
      ],
      [
        "e",
        "df"
      ],
      [
        "ddddddcddddddc",
        "ddddddf"
      ],
      [
        "dde",
        "de"
      ],
      [
        "e",
        "ddc"
      ],
      [
        "e",
        "a"
      ],
      [
        "dddddddddddddc",
        "ddddddddddddde"
      ],
      [
        "g",
        "c"
      ],
      [
        "dddddddddddddddddddd",
        "e"
      ],
      [
        "ddddddc",
        "ddddddedddddde"
      ],
      [
        "f",
        "b"
      ],
      [
        "ddddc",
        "df"
      ],
      [
        "e",
        "d"
      ],
      [
        "dddddddddddddddddddd",
        "c"
      ],
      [
        "c",
        "dde"
      ],
      [
        "dddddddd",
        "de"
      ],
      [
        "ddddddf",
        "dddddde"
      ],
      [
        "e",
        "dde"
      ],
      [
        "dddddddd",
        "dc"
      ],
      [
        "dddde",
        "db"
      ],
      [
        "ddddddc",
        "ddddddb"
      ],
      [
        "d",
        "k"
      ],
      [
        "e",
        "ddde"
      ],
      [
        "c",
        "db"
      ],
      [
        "dddddddddddddb",
        "dddddddddddddf"
      ],
      [
        "dddd",
        "dc"
      ],
      [
        "dd",
        "d"
      ],
      [
        "dd",
        "h"
      ],
      [
        "b",
        "f"
      ],
      [
        "c",
        "a"
      ],
      [
        "dddd",
        "de"
      ],
      [
        "c",
        "ddc"
      ],
      [
        "e",
        "db"
      ],
      [
        "c",
        "g"
      ],
      [
        "dc",
        "dc"
      ],
      [
        "c",
        "d"
      ],
      [
        "e",
        "h"
      ],
      [
        "b",
        "d"
      ],
      [
        "dddde",
        "df"
      ],
      [
        "ddddc",
        "db"
      ],
      [
        "e",
        "dddc"
      ],
      [
        "de",
        "de"
      ],
      [
        "dd",
        "dg"
      ],
      [
        "c",
        "dddc"
      ],
      [
        "ddddddb",
        "ddddddf"
      ],
      [
        "e",
        "cc"
      ],
      [
        "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd",
        "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd"
      ],
      [
        "dd",
        "da"
      ],
      [
        "f",
        "a"
      ],
      [
        "b",
        "g"
      ],
      [
        "dddde",
        "dddddddd"
      ],
      [
        "ddddddcddddddcddddddedddddde",
        "ddddddcddddddcddddddedddddde"
      ],
      [
        "b",
        "a"
      ],
      [
        "ddddc",
        "dddddddd"
      ],
      [
        "f",
        "g"
      ],
      [
        "dddd",
        "dddddddc"
      ],
      [
        "dddddd",
        "h"
      ],
      [
        "b",
        "dc"
      ],
      [
        "f",
        "d"
      ],
      [
        "ddc",
        "dddc"
      ],
      [
        "c",
        "df"
      ],
      [
        "f",
        "de"
      ],
      [
        "e",
        "dg"
      ],
      [
        "cdc",
        "ddde"
      ],
      [
        "dde",
        "ddde"
      ],
      [
        "ede",
        "dddc"
      ],
      [
        "c",
        "ddde"
      ],
      [
        "ddddddcddddddc",
        "ddddddddddddde"
      ],
      [
        "c",
        "h"
      ],
      [
        "Â",
        "ģ"
      ],
      [
        "ddddddeddddddc",
        "ddddddeddddddc"
      ],
      [
        "dddddddddddddc",
        "ddddddcddddddedddddde"
      ],
      [
        "de",
        "dddd"
      ],
      [
        "ddddddcddddddc",
        "ddddddedddddddddddddc"
      ],
      [
        "d",
        "l"
      ],
      [
        "dddddddddddddb",
        "ddddddc"
      ],
      [
        "dc",
        "dddd"
      ],
      [
        "a",
        "a"
      ],
      [
        "e",
        "i"
      ],
      [
        "dde",
        "dc"
      ],
      [
        "de",
        "ddc"
      ],
      [
        "ee",
        "dc"
      ],
      [
        "f",
        "dc"
      ],
      [
        "c",
        "ec"
      ],
      [
        "e",
        "da"
      ],
      [
        "b",
        "db"
      ],
      [
        "c",
        "ee"
      ],
      [
        "f",
        "df"
      ],
      [
        "a",
        "d"
      ],
      [
        "edddd",
        "dc"
      ],
      [
        "Â",
        "Ģ"
      ],
      [
        "b",
        "h"
      ],
      [
        "ddddddc",
        "dddddde"
      ],
      [
        "dddd",
        "ddddddde"
      ],
      [
        "c",
        "da"
      ],
      [
        "g",
        "g"
      ],
      [
        "f",
        "h"
      ],
      [
        "Â",
        "Ĥ"
      ],
      [
        "dddddddddddd",
        "da"
      ],
      [
        "a",
        "g"
      ],
      [
        "dddddd",
        "d"
      ],
      [
        "b",
        "cc"
      ],
      [
        "ddddddc",
        "ddddddf"
      ],
      [
        "ddddddddde",
        "dddc"
      ],
      [
        "ddc",
        "de"
      ],
      [
        "dde",
        "c"
      ],
      [
        "ddddc",
        "dg"
      ],
      [
        "ddddddb",
        "ddddddddddddde"
      ],
      [
        "a",
        "e"
      ],
      [
        "dddddddddc",
        "ddde"
      ],
      [
        "f",
        "ee"
      ],
      [
        "dddddddddddd",
        "dg"
      ],
      [
        "ddddddcddddddc",
        "ddddddc"
      ],
      [
        "b",
        "de"
      ],
      [
        "dd",
        "i"
      ],
      [
        "edddd",
        "de"
      ],
      [
        "dddde",
        "da"
      ],
      [
        "dde",
        "dedc"
      ],
      [
        "dddddddddddddddd",
        "dddddddddddd"
      ],
      [
        "`",
        "`"
      ],
      [
        "e",
        "j"
      ],
      [
        "ddddddf",
        "dddddddddddddb"
      ],
      [
        "ddddddb",
        "ddddddedddddde"
      ],
      [
        "d",
        "m"
      ],
      [
        "ddddddc",
        "dddddddddddddf"
      ],
      [
        "a",
        "b"
      ],
      [
        "c",
        "i"
      ],
      [
        "dddd",
        "dddddde"
      ],
      [
        "c",
        "dg"
      ],
      [
        "de",
        "dddc"
      ],
      [
        "ddc",
        "e"
      ],
      [
        "dd",
        "dh"
      ],
      [
        "dddddde",
        "ddddddcddddddcddddddedddddde"
      ],
      [
        "ddddedc",
        "ddddedc"
      ],
      [
        "de",
        "ec"
      ],
      [
        "Â",
        "ĥ"
      ],
      [
        "dddd",
        "ddddddc"
      ],
      [
        "a",
        "f"
      ],
      [
        "a",
        "h"
      ],
      [
        "dddddddddddddddddddd",
        "ddddddde"
      ],
      [
        "ddde",
        "ddc"
      ],
      [
        "cc",
        "de"
      ],
      [
        "ddcddde",
        "ddcddde"
      ],
      [
        "dddddddddddddddddddd",
        "dddddddc"
      ],
      [
        "dddddddddddddb",
        "ddddddddddddde"
      ],
      [
        "dddc",
        "ddc"
      ],
      [
        "dddddddddddddc",
        "ddddddedddddde"
      ],
      [
        "f",
        "db"
      ],
      [
        "g",
        "d"
      ],
      [
        "dddc",
        "ddb"
      ],
      [
        "ddddddcddddddddddddde",
        "ddddddcddddddddddddde"
      ],
      [
        "ddddddedddddde",
        "dddddde"
      ],
      [
        "g",
        "b"
      ],
      [
        "ddddddb",
        "dddddde"
      ],
      [
        "ddddc",
        "da"
      ],
      [
        "dddddddddddddddddddddddddddddddd",
        "dddddddddddddddd"
      ],
      [
        "ddc",
        "dcde"
      ],
      [
        "ddde",
        "dde"
      ],
      [
        "g",
        "f"
      ],
      [
        "dc",
        "dde"
      ],
      [
        "ddddcde",
        "ddddcde"
      ],
      [
        "de",
        "dde"
      ],
      [
        "ddde",
        "ddf"
      ],
      [
        "dddc",
        "dde"
      ],
      [
        "dddde",
        "dg"
      ],
      [
        "ddddddcddddddcddddddcddddddc",
        "ddddddcddddddcddddddcddddddc"
      ],
      [
        "Â",
        "Ħ"
      ],
      [
        "_",
        "`"
      ],
      [
        "b",
        "i"
      ],
      [
        "dc",
        "ddc"
      ],
      [
        "ddddddeddddddc",
        "ddddddddddddde"
      ],
      [
        "g",
        "e"
      ],
      [
        "d",
        "n"
      ],
      [
        "Â",
        "ħ"
      ],
      [
        "dc",
        "ddde"
      ],
      [
        "de",
        "db"
      ],
      [
        "ee",
        "ec"
      ],
      [
        "ddedddc",
        "ddedddc"
      ],
      [
        "f",
        "dg"
      ],
      [
        "f",
        "i"
      ],
      [
        "g",
        "h"
      ],
      [
        "b",
        "df"
      ],
      [
        "g",
        "a"
      ],
      [
        "dddddde",
        "ddddddcddddddc"
      ],
      [
        "de",
        "cc"
      ],
      [
        "ddc",
        "dddf"
      ],
      [
        "d",
        "Z"
      ],
      [
        "c",
        "j"
      ],
      [
        "e",
        "dh"
      ],
      [
        "dc",
        "ee"
      ],
      [
        "b",
        "ee"
      ],
      [
        "dde",
        "dddb"
      ],
      [
        "e",
        "k"
      ],
      [
        "Â",
        "Ĩ"
      ],
      [
        "dddddddddddddb",
        "ddddddedddddde"
      ],
      [
        "dddddddddddddcddddddddddddde",
        "dddddddddddddcddddddddddddde"
      ],
      [
        "b",
        "da"
      ],
      [
        "b",
        "ec"
      ],
      [
        "dc",
        "df"
      ],
      [
        "d",
        "Y"
      ],
      [
        "ddddddbddddddc",
        "ddddddeddddddf"
      ],
      [
        "f",
        "cc"
      ],
      [
        "f",
        "ec"
      ],
      [
        "dddddddddddddbdddddddddddddf",
        "dddddddddddddbdddddddddddddf"
      ],
      [
        "ddde",
        "ddb"
      ],
      [
        "ddddddcddddddc",
        "dddddde"
      ],
      [
        "ddddddcddddddcddddddedddddde",
        "ddddddcddddddddddddde"
      ],
      [
        "dddd",
        "dcc"
      ],
      [
        "ddddddc",
        "ddddddedddddddddddddc"
      ],
      [
        "dddc",
        "ddf"
      ],
      [
        "ddddddc",
        "ddddddbdddddddddddddf"
      ],
      [
        "cdddd",
        "de"
      ],
      [
        "Â",
        "ĩ"
      ],
      [
        "ce",
        "dc"
      ],
      [
        "ddddddg",
        "ddddddg"
      ],
      [
        "ddc",
        "ec"
      ],
      [
        "`",
        "_"
      ],
      [
        "Â",
        "Ī"
      ],
      [
        "edddd",
        "db"
      ],
      [
        "d",
        "o"
      ],
      [
        "ddddddf",
        "ddddddeddddddc"
      ],
      [
        "ddddcdc",
        "ddddcdc"
      ],
      [
        "ddddddc",
        "ddddddeddddddf"
      ],
      [
        "ddddddb",
        "ddddddedddddddddddddc"
      ],
      [
        "cc",
        "c"
      ],
      [
        "dddddda",
        "dddddda"
      ],
      [
        "f",
        "ef"
      ],
      [
        "ddddddcddddddcddddddedddddddddddddc",
        "ddddddddddddde"
      ],
      [
        "a",
        "i"
      ],
      [
        "h",
        "c"
      ],
      [
        "^",
        "`"
      ],
      [
        "ddddddedddddde",
        "dddddddddddddc"
      ],
      [
        "ddddede",
        "ddddede"
      ],
      [
        "ddddddb",
        "ddddddeddddddf"
      ],
      [
        "dde",
        "df"
      ],
      [
        "f",
        "ce"
      ],
      [
        "cdddd",
        "dc"
      ],
      [
        "e",
        "dd"
      ],
      [
        "edddd",
        "df"
      ],
      [
        "cdc",
        "dc"
      ],
      [
        "h",
        "h"
      ],
      [
        "g",
        "i"
      ],
      [
        "f",
        "j"
      ],
      [
        "b",
        "j"
      ],
      [
        "ddc",
        "c"
      ],
      [
        "e",
        "l"
      ],
      [
        "e",
        "ddf"
      ],
      [
        "dddd",
        "dec"
      ],
      [
        "ddddddeddddddeddddddedddddde",
        "ddddddeddddddeddddddedddddde"
      ],
      [
        "cdddd",
        "df"
      ],
      [
        "_",
        "_"
      ],
      [
        "ddc",
        "db"
      ],
      [
        "Â",
        "Ĭ"
      ],
      [
        "f",
        "da"
      ],
      [
        "ddddddf",
        "dddddddddddddc"
      ],
      [
        "dddddde",
        "ddddddb"
      ],
      [
        "dddddddd",
        "c"
      ],
      [
        "dde",
        "ce"
      ],
      [
        "ddddddcddddddcddddddf",
        "ddddddcddddddcddddddf"
      ],
      [
        "b",
        "dg"
      ],
      [
        "dddde",
        "d"
      ],
      [
        "ddddddbddddddb",
        "ddddddbddddddb"
      ],
      [
        "dddddddddddddbddddddc",
        "ddddddeddddddf"
      ],
      [
        "dddd",
        "db"
      ],
      [
        "de",
        "d"
      ],
      [
        "h",
        "g"
      ],
      [
        "h",
        "d"
      ],
      [
        "dd",
        "j"
      ],
      [
        "cdddd",
        "db"
      ],
      [
        "a",
        "db"
      ],
      [
        "c",
        "k"
      ],
      [
        "ddddddf",
        "ddddddc"
      ],
      [
        "g",
        "ee"
      ],
      [
        "dc",
        "ce"
      ],
      [
        "Â",
        "ī"
      ],
      [
        "dddd",
        "df"
      ],
      [
        "de",
        "df"
      ],
      [
        "Â",
        "ĭ"
      ],
      [
        "ddc",
        "dddg"
      ],
      [
        "b",
        "dde"
      ],
      [
        "e",
        "ddb"
      ],
      [
        "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd",
        "dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd"
      ],
      [
        "dddddddddddddcddddddcddddddedddddde",
        "dddddddddddddcddddddcddddddedddddde"
      ],
      [
        "ddc",
        "cc"
      ],
      [
        "f",
        "dh"
      ],
      [
        "`",
        "^"
      ],
      [
        "a",
        "dc"
      ],
      [
        "h",
        "b"
      ],
      [
        "a",
        "cc"
      ],
      [
        "dddddddd",
        "e"
      ],
      [
        "ec",
        "de"
      ],
      [
        "e",
        "bc"
      ],
      [
        "c",
        "dh"
      ],
      [
        "b",
        "ce"
      ],
      [
        "dddc",
        "dda"
      ],
      [
        "a",
        "j"
      ],
      [
        "ddddddeddddddc",
        "dddddde"
      ],
      [
        "g",
        "df"
      ],
      [
        "Â",
        "į"
      ],
      [
        "ddcdc",
        "dc"
      ],
      [
        "dddddde",
        "ddddddddddddddddddddc"
      ],
      [
        "e",
        "m"
      ],
      [
        "ddc",
        "dddb"
      ],
      [
        "^",
        "_"
      ],
      [
        "ddde",
        "edc"
      ],
      [
        "ee",
        "dddd"
      ],
      [
        "ddddddg",
        "ddddddc"
      ],
      [
        "dddddde",
        "ddddddcddddddcddddddddddddde"
      ],
      [
        "dddde",
        "dddddde"
      ],
      [
        "cc",
        "dc"
      ],
      [
        "df",
        "dc"
      ],
      [
        "dddddd",
        "dedc"
      ],
      [
        "f",
        "ddc"
      ],
      [
        "d",
        "X"
      ],
      [
        "]",
        "`"
      ],
      [
        "ee",
        "de"
      ],
      [
        "ee",
        "db"
      ],
      [
        "ddddc",
        "ddddddc"
      ],
      [
        "ddededc",
        "ddededc"
      ],
      [
        "c",
        "l"
      ],
      [
        "dddddddddddddb",
        "ddddddeddddddf"
      ],
      [
        "dddddddddddddc",
        "ddddddcddddddddddddde"
      ],
      [
        "ddddddfddddddf",
        "ddddddfddddddf"
      ],
      [
        "Â",
        "Ĳ"
      ],
      [
        "c",
        "dd"
      ],
      [
        "h",
        "a"
      ],
      [
        "f",
        "k"
      ],
      [
        "f",
        "dde"
      ],
      [
        "ddddddbdddddddddddddf",
        "ddddddcddddddcddddddf"
      ],
      [
        "cdcddde",
        "cdcddde"
      ],
      [
        "dddddda",
        "dddddde"
      ],
      [
        "ddede",
        "de"
      ],
      [
        "dddddddddddddcddddddddddddde",
        "ddddddeddddddcddddddcddddddedddddde"
      ],
      [
        "Â",
        "Į"
      ],
      [
        "dde",
        "ddda"
      ],
      [
        "ddddc",
        "d"
      ],
      [
        "ec",
        "dc"
      ],
      [
        "cc",
        "ce"
      ],
      [
        "dddddddddddddddddddde",
        "ddddddc"
      ],
      [
        "cdc",
        "dcde"
      ],
      [
        "i",
        "g"
      ],
      [
        "ddde",
        "ddg"
      ],
      [
        "ddddddedddddddddddddc",
        "ddddddedddddddddddddc"
      ],
      [
        "dde",
        "dddf"
      ],
      [
        "d",
        "p"
      ],
      [
        "dddddddddddddddddddd",
        "f"
      ],
      [
        "d",
        "W"
      ],
      [
        "dddddddddddddb",
        "ddddddf"
      ],
      [
        "e",
        "Z"
      ],
      [
        "g",
        "de"
      ],
      [
        "b",
        "k"
      ],
      [
        "i",
        "c"
      ],
      [
        "ddddddbddddddc",
        "ddddddf"
      ],
      [
        "ee",
        "e"
      ],
      [
        "ddc",
        "dde"
      ],
      [
        "ddddddde",
        "dedddc"
      ],
      [
        "ddddddb",
        "ddddddcddddddddddddde"
      ],
      [
        "cc",
        "df"
      ],
      [
        "ededddc",
        "ededddc"
      ],
      [
        "Â",
        "ĳ"
      ],
      [
        "d",
        "q"
      ],
      [
        "ddddddc",
        "dddddddddddddddddddde"
      ],
      [
        "g",
        "dc"
      ],
      [
        "ddddc",
        "dddddde"
      ],
      [
        "dddd",
        "cc"
      ],
      [
        "ddddddcddddddcddddddedddddddddddddc",
        "ddddddedddddde"
      ],
      [
        "h",
        "e"
      ],
      [
        "_",
        "^"
      ],
      [
        "g",
        "j"
      ],
      [
        "ee",
        "c"
      ],
      [
        "dddd",
        "f"
      ],
      [
        "h",
        "f"
      ],
      [
        "dddddd",
        "i"
      ],
      [
        "ec",
        "df"
      ],
      [
        "dddddddc",
        "dcddde"
      ],
      [
        "dddde",
        "ddddddc"
      ],
      [
        "i",
        "a"
      ],
      [
        "dddd",
        "b"
      ],
      [
        "ddddddf",
        "ddddddedddddddddddddc"
      ],
      [
        "Â",
        "İ"
      ],
      [
        "ddddddbddddddc",
        "ddddddfdddddde"
      ],
      [
        "ede",
        "dedc"
      ],
      [
        "dddddddd",
        "dddddd"
      ],
      [
        "ddddddcddddddcddddddeddddddeddddddcddddddcddddddedddddde",
        "ddddddcddddddcddddddedddddde"
      ],
      [
        "b",
        "eb"
      ],
      [
        "g",
        "cc"
      ],
      [
        "\\",
        "`"
      ],
      [
        "dddddddddddddc",
        "ddddddc"
      ],
      [
        "de",
        "da"
      ],
      [
        "ee",
        "cc"
      ],
      [
        "b",
        "ef"
      ],
      [
        "c",
        "bc"
      ],
      [
        "e",
        "n"
      ],
      [
        "dde",
        "ddc"
      ],
      [
        "ddddddcddddddc",
        "ddddddeddddddf"
      ],
      [
        "c",
        "Z"
      ],
      [
        "a",
        "da"
      ],
      [
        "h",
        "i"
      ],
      [
        "dde",
        "cc"
      ],
      [
        "ddde",
        "dc"
      ],
      [
        "ddddcdddddddd",
        "e"
      ],
      [
        "c",
        "ddf"
      ],
      [
        "e",
        "Y"
      ],
      [
        "e",
        "dddddddddddd"
      ],
      [
        "dd",
        "di"
      ],
      [
        "dddc",
        "ddg"
      ],
      [
        "c",
        "Y"
      ],
      [
        "c",
        "dec"
      ],
      [
        "d",
        "r"
      ],
      [
        "f",
        "l"
      ],
      [
        "dddd",
        "ee"
      ],
      [
        "e",
        "di"
      ],
      [
        "ddddddg",
        "dddddde"
      ],
      [
        "a",
        "k"
      ],
      [
        "c",
        "ddb"
      ],
      [
        "g",
        "dg"
      ],
      [
        "e",
        "o"
      ],
      [
        "dddddddddddddddd",
        "dddddddd"
      ],
      [
        "b",
        "Y"
      ],
      [
        "`",
        "]"
      ],
      [
        "ede",
        "dc"
      ],
      [
        "ddddddbddddddf",
        "ddddddbddddddf"
      ],
      [
        "b",
        "ddc"
      ],
      [
        "ce",
        "cc"
      ],
      [
        "ddddddbddddddc",
        "ddddddedddddde"
      ],
      [
        "a",
        "de"
      ],
      [
        "b",
        "l"
      ],
      [
        "dde",
        "db"
      ],
      [
        "Â",
        "ı"
      ],
      [
        "ec",
        "ee"
      ],
      [
        "ddddedddddddd",
        "c"
      ],
      [
        "ddcdc",
        "df"
      ],
      [
        "ddede",
        "db"
      ],
      [
        "a",
        "ee"
      ],
      [
        "b",
        "dh"
      ],
      [
        "d",
